[
  {
    "chunk_id": "GT_CHUNK_01",
    "document": "resvaneundersokning.pdf",
    "pages": [2],
    "text": "Färdmedelsfördelning är ett annat ord för andelen resor med olika färdsätt. I enkäten fanns det totalt 17 olika färdmedel att koppla till sin förflyttning. Resultat för färdmedel presenteras med antingen sex eller sju huvudkategorier. Bilderna nedan visar de sju huvudtyperna av färdmedel: Gång, Cykel, Bil, Buss, Tåg, Flyg, Annat. Bil kopplas till valen Bil som förare och Bil som passagerare. Annat inkluderar MC/Moped, A-traktor/EPA, Taxi, Färdtjänst, Båt."
  },
  {
    "chunk_id": "GT_CHUNK_02",
    "document": "resvaneundersokning.pdf",
    "pages": [3],
    "text": "I likhet med tidigare undersökningar är bil fortsatt det vanligaste färdmedlet, även om resultaten tyder på att andelen resor med bil har minskat över åren. Andelen resor med bil 2023 var 49 procent, jämfört med 53 procent 2018 och 58 procent 2007. Därefter är de vanligaste färdsätten cykel, buss och tåg i den ordningen. Resultaten tyder på att resor med buss och tåg har ökat jämfört med 2018. Andelen resor till fots var 7 procent 2023, vilket är en minskning jämfört med tidigare år."
  },
  {
    "chunk_id": "GT_CHUNK_03",
    "document": "resvaneundersokning.pdf",
    "pages": [3],
    "text": "Målet för 2030 är att 42 procent av samtliga resor i Skåne ska vara med bil. Enligt 2023 års undersökning är andelen resor med bil 49 procent. Andelen resor med buss behöver öka något från 13 procent till 15 procent för att uppnå 2030-målet. Målet för cykelns andel är 19 procent, och 2023 låg den på 17 procent. För tåg är målet 13 procent och 2023 låg andelen på 12 procent. Andelen resor till fots behöver öka från 7 procent till 11 procent för att uppnå målen."
  },
  {
    "chunk_id": "GT_CHUNK_04",
    "document": "resvaneundersokning.pdf",
    "pages": [4],
    "text": "Figur 6.2 visar färdmedelsfördelning per kön. De flesta resor görs med bil, följt av cykel, buss och tåg. Männen gör fler resor med bil (52.4%) medan kvinnor färdas mer med buss (16.9% mot 8.4%) och till fots (10.0% mot 5.9%). För cykel- och tågresorna är andelen uppdelat på kön jämnt fördelade."
  },
  {
    "chunk_id": "GT_CHUNK_05",
    "document": "resvaneundersokning.pdf",
    "pages": [5],
    "text": "Sett till ålder finns vissa skillnader vad gäller andel resor med olika färdmedel. Andelen bilresor är betydligt högre bland äldre invånare jämfört med yngre. Samtidigt reser yngre invånare i högre grad med kollektivtrafik. Till exempel är andelen bussresor högst bland invånarna 15-18 år, följt av invånarna 19-24 år."
  },
  {
    "chunk_id": "GT_CHUNK_06",
    "document": "resvaneundersokning.pdf",
    "pages": [6],
    "text": "Bland de med en sammanlagd hushållsinkomst under 10 000 kronor per månad, är buss det vanligast färdmedlet med ungefär 36 procent av resorna. Andelen resor med bil ökar i takt med att inkomst stiger för de lägre inkomstklasserna men stabiliseras sedan. Andelen resor gjorda med buss minskar i stället med ökad inkomst för de lägre inkomstklasserna för att stabiliseras på en lägre nivå för de högre inkomstklasserna. Kollektiva färdmedel är mer vanliga i de lägre inkomstgrupperna."
  },
  {
    "chunk_id": "GT_CHUNK_07",
    "document": "resvaneundersokning.pdf",
    "pages": [6],
    "text": "Figur 6.5 visar att invånarna reser olika beroende på sin huvudsakliga sysselsättning. Studenter väljer i högre utsträckning än lönearbetare/egenföretagare att resa med kollektivtrafik såsom buss och tåg. Studenter reser också i lägre grad än övriga sysselsättningsgrupper med bil. Föräldralediga har den högsta andelen resor till fots på 31 procent."
  },
  {
    "chunk_id": "GT_CHUNK_08",
    "document": "resvaneundersokning.pdf",
    "pages": [7],
    "text": "Figur 6.6 visar färdmedelsfördelningen fördelat över olika veckodagar. Andelen resor med olika färdmedel är relativt jämnt fördelat över dagarna. Däremot ökar andelen resor med bil något på lördagar (56%) och söndagar (58%) jämfört med vardagar (exempelvis 47% på måndag)."
  },
  {
    "chunk_id": "GT_CHUNK_09",
    "document": "resvaneundersokning.pdf",
    "pages": [8],
    "text": "Det går att urskilja skillnader i val av färdmedel beroende på reslängd. Många väljer att gå eller cykla vid kortare resor. Närmare fyra av tio (36%) väljer att gå när det är resor som är kortare än en kilometer. Drygt två av tio (21%) väljer att cykla för resor inom detta intervall. Andelen resor med bil ökar med distansen."
  },
  {
    "chunk_id": "GT_CHUNK_10",
    "document": "resvaneundersokning.pdf",
    "pages": [9],
    "text": "Figur 6.8 visar färdmedelsfördelningen per typ av ort. En tydlig skillnad är att bilen är ett mindre vanligare färdmedel i större tätorter (31%) kontra de andra två ortskategorierna (73% på landsbygd, 56% i tätort). Mönstret är spegelvänt för gång, cykel och buss som färdmedel, där dessa är mer vanligt förekommande i större tätorter. Andelen resor med tåg som huvudfärdmedel är relativt lika varandra över de olika ortstyperna."
  },
  {
    "chunk_id": "GT_CHUNK_11",
    "document": "resvaneundersokning.pdf",
    "pages": [10],
    "text": "Bilen står för en stor andel av resorna över de olika ortstyperna, särskilt för de längre resorna. Vid kortare resor och för större tätorter blir bilen ett mindre vanligt färdmedel medan det för de andra orterna förblir det vanligaste. För resor <1 km på landsbygd står bil för 80% av resorna, i större tätort endast 24%. Gång och cykel är relativt vanliga för de kortare resorna och som mest vanliga i större tätorter."
  },
  {
    "chunk_id": "GT_CHUNK_12",
    "document": "resvaneundersokning.pdf",
    "pages": [11],
    "text": "Valet av färdmedel påverkas även av resans ärende. Resor till skola och utbildning genomförs främst via buss (39%), följt av tåg (24%). När det gäller resor till arbetsplatsen är i stället bil det vanligaste färdmedlet (49%). Bil används även oftast i samband med hämtning/lämning/skjutsning (68%). Flyg utgör ungefär fyra procent resor som görs i tjänsten."
  },
  {
    "chunk_id": "GT_CHUNK_13",
    "document": "resvaneundersokning.pdf",
    "pages": [12],
    "text": "Resultaten tyder på att de som saknar tillgång till bil reser oftast med buss (33%), cykel (23%) och tåg (23%). Bland de som aldrig åker kollektivt reser ungefär åtta av tio (84%) med bil i stället. De som saknar tillgång till cykel reser i jämförelse med genomsnittet mer buss (22% mot 13% totalt)."
  },
  {
    "chunk_id": "GT_CHUNK_14",
    "document": "resvaneundersokning.pdf",
    "pages": [12],
    "text": "Mer än tre av fyra resor med ett motoriserat färdsätt utgörs av bil, antingen som förare (55.1%) eller passagerare (15.7%). Därefter är bussresor det vanligaste motoriserade färdmedlet med drygt 20 procent, inkluderat både regional (10.0%) och stadstrafik (8.7%). De övriga kategorierna utgör väldigt små andelar av den motoriserade trafiken."
  }
]